app/views/departures/_form.html.erb

    <%= f.label :articulos_id %>
    <%= collection_select(:departure, :articulos, Producto.all, :articulos, :articulos, { prompt: true}, {:multiple => false})%>
---
SELECT "departures".* FROM "departures"
SELECT "productos".* FROM "productos"