app/views/entradas/_form.html.erb

        <%= f.label :articulo %>
        <%= collection_select(:entradas, :articulos, Producto.all, :articulos, :articulos, { prompt: "selecciona un producto"}, {:multiple => false})%>
---
SELECT "productos".* FROM "productos"