app/controllers/departures_controller.rb

  def index
    @departures = Departure.all
---
SELECT "departures".* FROM "departures"

  def create
    @departure = Departure.new(departure_params)

    respond_to do |format|
      if @departure.save
---
INSERT INTO "departures" ("fecha", "numero", "piezas", "solicita", "autoriza", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["fecha", Fri, 01 Jul 2016], ["numero", 1323], ["piezas", 31231], ["solicita", "3123"], ["autoriza", "3123123"], ["created_at", 2016-07-01 18:33:42 UTC], ["updated_at", 2016-07-01 18:33:42 UTC]]

  def update
    respond_to do |format|
      if @departure.update(departure_params)
---
UPDATE "departures" SET "articulos" = ?, "updated_at" = ? WHERE "departures"."id" = ?  [["articulos", "#<Producto::ActiveRecord_Relation:0x4109b80>"], ["updated_at", 2016-07-01 19:49:34 UTC], ["id", 14]]

  def destroy
    @departure.destroy
---
DELETE FROM "departures" WHERE "departures"."id" = ?  [["id", 3]]

    def set_departure
      @departure = Departure.find(params[:id])
---
SELECT  "departures".* FROM "departures" WHERE "departures"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]