app/controllers/entradas_controller.rb

  def index
    @entradas = Entrada.all
---
SELECT "entradas".* FROM "entradas"

  def create
    @entrada = Entrada.new(entrada_params)

    respond_to do |format|
      if @entrada.save
---
INSERT INTO "entradas" ("fecha", "remision", "cantidad", "articulo", "refaccion", "recibe", "proveedor", "contacto", "autoriza", "solicta", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @entrada.destroy
---
DELETE FROM "entradas" WHERE "entradas"."id" = ?  [["id", 1]]

    def set_entrada
      @entrada = Entrada.find(params[:id])
---
SELECT  "entradas".* FROM "entradas" WHERE "entradas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]