app/controllers/productos_controller.rb

INSERT INTO "productos" ("articulos", "existencia", "stockmin", "stockmax", "disponibles", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["articulos", "anticongelante"], ["existencia", 36], ["stockmin", 45], ["stockmax", 52], ["disponibles", true], ["created_at", 2016-06-15 17:30:50 UTC], ["updated_at", 2016-06-15 17:30:50 UTC]]
---
  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save

UPDATE "productos" SET "existencia" = ?, "stockmin" = ?, "stockmax" = ?, "updated_at" = ? WHERE "productos"."id" = ?  [["existencia", 110], ["stockmin", 11], ["stockmax", 500], ["updated_at", 2016-07-02 19:41:43 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @producto.update(producto_params)

DELETE FROM "productos" WHERE "productos"."id" = ?  [["id", 2]]
---
  def destroy
    @producto.destroy

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_producto
      @producto = Producto.find(params[:id])